Boeing737Max_OpenFOAM_CFD/Scene/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;          // Total simulation time: 5 seconds

deltaT          0.001;      // Time step: 0.001 seconds

maxCo           0.5;        // Maintain stable CFL number

writeControl    runTime;

writeInterval   0.01667;    // Write results every 0.01667 seconds to generate exactly 300 frames

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
    #include "forceCoeffs"     // Retain force coefficient calculations
    #include "ensightWrite"    // Output files in Ensight format
    // Comment out features that might not be needed for now
    // #include "wallBoundedStreamLines"
    // #include "cuttingPlane"

    streamLines
    {
        type            streamLine;
        functionObjectLibs ("libfieldFunctionObjects.so");
        inputMode       continuous;   // Use continuous flow field
        setFormat       vtk;          // Set output format to VTK
        fields          (U);          // Specify the velocity field to track

        seedSampleSet
        {
            type        uniform;       // Uniformly distribute seed points
            axis        x;             // Choose the direction of seed points
            start       (100 30 10);  // Expand the range
            end         (450 300 150);
            nPoints     500;          // Increase the number of seed points
        }

        trackForward    true;          // Enable forward tracking
        trackBackward   true;          // Enable backward tracking
        lifeTime        200;           // Set maximum tracking time
    }
}

// ************************************************************************* //