Boeing737Max_OpenFOAM_CFD/Scene/system/profiling
// -*- C++ -*-

profiling
{
    #includeEtc "caseDicts/profiling/parallel.cfg"
    detail  1;
}

// ************************************************************************* //
